user_num = int(input("enter any number: "))

if user_num >10:
    print("მეტია ათზე!")
elif user_num ==10:
    print("უდრის ათს")
else:
    print("ნაკლებია ათზე!")
    
#მომხმარებლის ნიშნებისგან გამოანგარიშება საშვალო არითმეტიკული და თუ ცხრაზე მეტი იქნება დაუპრინტეთ გილოცავ მატრიცელო
#შენ გადმოგეცა 300 ლარიანი ბანძი ტოსტერი რასაც შეალიე შენი ცხოვრების წლები
#თუ ეს იქნება 5 ზე ნაკლები გილოცავ შენ გაექეცი მატრიცას
#თუ იქნება 5 იდან 9 მდე დაუპრინტე YOU ARE MID
#თუ იქნება 10 ზე მეტი ან 0 ზე ნაკლები დაუპრინტე there is something wrong with you