#list (სიები)

m = [
    [1, 2, 3],
    [4, 5, 6]
]
print(m)       

#მატრიცა (ცხრილი)
#როცა სიაში გვაქვს კიდევ ერთი სია ეს არის ორ განზომილებიანი სია (ცხრილი) მაგრამ ამას პროფესიონალები უწოდებენ მატრიცას

m = [
    [1, 2, 3],    #0
    [4, 5, 6]     #1
]   #0  #1 #2 
print(m[1][2])

#რომ დავპრინტოთ 6-ი ჯერ უნდა ავირჩიოთ ცხრილი ანუ [1] და შემდეგ 6 იანის ინდექსი [2]


m = [[1, 2, 3,],[4, 5, 6,],[7, 8, 9,]]
     #o(m[0])    #1(m[1])    #2(m[2])


#in ით ვამოწმებთ არის თუ არა სიაში კონკრეტული სიტყვა, თუ არის დაიპრინტება true თუ არარის დაიპრინტება false

nums = [10 ,9, 8, 7, 6, 5]

nums[0] = nums[1] - 5 #გამოაკლდება 9-ს 5-ი 
#[4, 9, 8, 7, 6, 5]
if 4 in nums:  #თუ რიცხვი 4 არის ამ სიაში დაიპრინტება  სიაში მესამე ადგილას მყოფი რიცხვი(7) გვხვდება
    print(nums[3])
else:           #თუ რიცხვი 4 არ გვხვდება ცხრილში დაიპრინტება ცხრილში მეოთხე ადგილას მყოფი რიცხვი (6) არ გვხვდება
    print(nums[4])


x = "hello world"

if "world" in x:
    print("yes")




