squares = [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]
print(squares[2:6]) # : შემოკლებული [2, 6] მდე ) (index)
print(squares[3:8])
print(squares[0:1])

squares = [0, 1, 3, 9, 16, 25, 36, 49, 64, 81]
print(squares[::2])  #დასაწყისიდან ბოლომდე ყოველი მეორე რიცხვი დაიპრინტება (2 ნაბიჯით)
print(squares[2:8:3])  #2 დან 8 მდე ყოველი მესამე დაიპრინტება (3 ნაბიჯით)

#კოდის შეტრიალება

nums = [1, 2, 3, 4, 5]
res = nums[::-1] 
print(res[2])

#დავალება: module 5 quiz, ყოველი 5 ის ჯერადი რიცხვი დავპრინტოთ 100 მდე range გამოყენებით
#sololearn functions პირველი (functions)


